kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Host-OLED-V_4_7_1/ESP32-S3-Host-OLED-V_4_7_1.ino
  int reading = digitalRead(PAGE_BTN_PIN);
  unsigned long now = millis();

  if (reading == LOW) {
    if (!isPageHolding) { isPageHolding = true; }
  } else {
    if (isPageHolding) {
      isPageHolding = false;
      clickCount++;
      lastReleaseTime = now;
    }
  }

  if (clickCount > 0 && (now - lastReleaseTime > 280)) {
    lastUserActivityTime = now;
    if (oledScreensaverActive) {
      oledScreensaverActive = false;
    } else if (clickCount >= 2) {
      oledScreensaverActive = true;
    } else {
      currentOledPage = (currentOledPage + 1) % (activeStationCount + 1);
    }
    updateHostOLED();
    clickCount = 0;
  }
}

// ----------------------------------------------------------------------------
// ESP-NOW Receive Callback
// ----------------------------------------------------------------------------
#if defined(ESP_IDF_VERSION) && ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
void OnDataRecv(const esp_now_recv_info_t *info, const uint8_t *incomingDataBytes, int len) {
  int8_t pktRssi = (info && info->rx_ctrl) ? info->rx_ctrl->rssi : -60;
#else
void OnDataRecv(const uint8_t *mac, const uint8_t *incomingDataBytes, int len) {
  int8_t pktRssi = -60;
#endif
  if (len != sizeof(struct_message)) return;

  struct_message incoming;
  memcpy(&incoming, incomingDataBytes, sizeof(incoming));
  if (incoming.stationId < 1 || incoming.stationId > MAX_SUPPORTED_STATIONS) return;

  int idx = incoming.stationId - 1;
  portENTER_CRITICAL(&dataMux);
  StationData &s = stations[idx];

  // นับหยดรายนาทีจากผลต่าง totalDrops (แพ็กเก็ตหายก็ไม่ทำให้หยดหาย)
  if (s.hasBaseline) {
    uint32_t delta = (incoming.totalDrops >= s.lastTotalDrops)
                     ? (incoming.totalDrops - s.lastTotalDrops)
                     : incoming.totalDrops;   // Station รีเซ็ต/รีบูต
    s.dropsInCurrentMinute += delta;
  } else {
    s.hasBaseline = true;
  }
  s.lastTotalDrops  = incoming.totalDrops;

  s.active          = true;
  s.isRunning       = (incoming.isRunning != 0);
  s.rssi            = pktRssi;
  s.batteryVolts    = incoming.batteryVolts;
  s.totalDrops      = incoming.totalDrops;
  s.flowRate_ml_hr  = s.isRunning ? incoming.flowRateHr : 0.0f;
  s.msSinceLastDrop = incoming.msSinceLastDrop;
  s.totalVolumeMl   = (float)s.totalDrops / (float)safeDropFactor(s.cfg.dropFactor);
  s.lastRecvTime    = millis();
  if (s.firstRecvTime == 0) s.firstRecvTime = s.lastRecvTime;
  // ตราบใดที่ยังมีหยดเข้ามา ให้เลื่อนเวลาอ้างอิงตาม เมื่อกด "เริ่มถุงใหม่" แล้วตัวนับกลับเป็น 0
  // ตัวจับเวลา 90 วินาทีจึงเริ่มนับจากจังหวะรีเซ็ต ไม่ใช่จากตอนเปิดเครื่อง
  if (s.totalDrops > 0) s.firstRecvTime = s.lastRecvTime;
  if ((incoming.flags & 0x01) && s.cfg.planVolumeMl > 0) s.nearEndAck = true;

  if (s.trialCase.active) {
    s.trialCase.actualVolume = s.totalVolumeMl;
    s.trialCase.errorMl = s.trialCase.actualVolume - s.trialCase.planVolume;
    if (s.trialCase.planVolume > 0) {
      s.trialCase.errorPercent = (s.trialCase.errorMl / s.trialCase.planVolume) * 100.0;
    }
  }
  portEXIT_CRITICAL(&dataMux);
}

// ----------------------------------------------------------------------------
// Host OLED Display & Block-Style UI Renderer
// ----------------------------------------------------------------------------
void renderBlockStyleGrid() {
  int topY = 11;
  int bottomY = 53;
  int totalH = bottomY - topY;

  int onlineCount = 0;
  int alarmBed = 0;
  uint8_t alarmCode = ALERT_NONE;

  for (int i = 0; i < activeStationCount; i++) {
    if (isStationOnline(i)) onlineCount++;
    if (alarmBed == 0 && isCriticalAlert(stations[i].alertCode)) {
      alarmBed = i + 1;
      alarmCode = stations[i].alertCode;
    }
  }

  if (activeStationCount == 1) {
    u8g2.drawRFrame(0, topY + 1, 128, totalH - 1, 3);
    u8g2.drawHLine(0, topY + 13, 128);
    bool online = isStationOnline(0);

    u8g2.setFont(u8g2_font_5x8_tf);
    u8g2.drawStr(6, topY + 9, "BED 01 BLOCK MONITOR");

    if (!online) {
      u8g2.setFont(u8g2_font_helvB10_tf);
      u8g2.drawStr(12, topY + 30, "OFFLINE");
    } else if (!stations[0].isRunning) {
      u8g2.setFont(u8g2_font_helvB10_tf);
      u8g2.drawStr(12, topY + 30, "PAUSED");
    } else {
      char rBuf[16];
      snprintf(rBuf, sizeof(rBuf), "%3.1f", stations[0].flowRate_ml_hr);
      u8g2.setFont(u8g2_font_logisoso16_tf);
      u8g2.drawStr(6, topY + 33, rBuf);
      u8g2.setFont(u8g2_font_5x8_tf);
      u8g2.drawStr(72, topY + 26, "mL/h");
    }

    char subBuf[40];
    snprintf(subBuf, sizeof(subBuf), "Vol:%3.1f/%.0fmL | %ddBm",
             stations[0].totalVolumeMl, stations[0].cfg.planVolumeMl, stations[0].rssi);
    u8g2.setFont(u8g2_font_4x6_tf);
    u8g2.drawStr(6, topY + 41, subBuf);
  }
  else if (activeStationCount == 2) {
    int cardW = 62;
    for (int i = 0; i < 2; i++) {
      int x = (i == 0) ? 0 : 66;
      u8g2.drawRBox(x, topY + 1, cardW, totalH - 1, 2);

      bool online = isStationOnline(i);

      char idStr[10];
      snprintf(idStr, sizeof(idStr), "BED %02d", i + 1);
      u8g2.setDrawColor(0);
      u8g2.setFont(u8g2_font_5x8_tf);
      u8g2.drawStr(x + 4, topY + 10, idStr);

      if (!online) {
        u8g2.setFont(u8g2_font_6x10_tf);
        u8g2.drawStr(x + 8, topY + 26, "OFFLINE");
      } else if (!stations[i].isRunning) {
        u8g2.setFont(u8g2_font_6x10_tf);
        u8g2.drawStr(x + 10, topY + 26, "PAUSED");
      } else {
        char rBuf[16];
        snprintf(rBuf, sizeof(rBuf), "%3.0f", stations[i].flowRate_ml_hr);
        u8g2.setFont(u8g2_font_helvB12_tf);
        u8g2.drawStr(x + 6, topY + 28, rBuf);
        u8g2.setFont(u8g2_font_4x6_tf);
        u8g2.drawStr(x + 38, topY + 28, "mh");
      }

      char vBuf[16];
      snprintf(vBuf, sizeof(vBuf), "V:%3.0fmL", stations[i].totalVolumeMl);
      u8g2.setFont(u8g2_font_4x6_tf);
      u8g2.drawStr(x + 4, topY + 38, vBuf);
      u8g2.setDrawColor(1);
    }
  }
  else {
    int cardW = 62;
    int rows = (activeStationCount + 1) / 2;
    int rowH = (rows <= 3) ? 14 : 10;   // 3-6 เตียง = 3 แถว, 7-8 เตียง = 4 แถว
    for (int i = 0; i < activeStationCount; i++) {
      int col = i % 2;
      int row = i / 2;
      int x = (col == 0) ? 0 : 65;
      int y = topY + row * rowH;
      int textY = y + ((rowH == 14) ? 9 : 7);

      bool online = isStationOnline(i);
      bool critical = online && stations[i].isRunning && isCriticalAlert(stations[i].alertCode);
      // เตียงที่มีเหตุวิกฤตแสดงเป็นกรอบทึบ (ตัวอักษรกลับสี) เพื่อให้เห็นชัดจากระยะไกล
      if (critical) { u8g2.drawRBox(x, y, cardW, rowH - 1, 2); u8g2.setDrawColor(0); }
      else u8g2.drawRFrame(x, y, cardW, rowH - 1, 2);

      char idStr[8];
      snprintf(idStr, sizeof(idStr), "B%d", i + 1);
      u8g2.setFont(u8g2_font_4x6_tf);
      u8g2.drawStr(x + 3, textY, idStr);

      if (!online) {
        u8g2.drawStr(x + 14, textY, "OFFLINE");
      } else if (!stations[i].isRunning) {
        u8g2.drawStr(x + 14, textY, "PAUSED");
      } else {
        char rBuf[24];
        snprintf(rBuf, sizeof(rBuf), "%3.0fmh %4.0fmL", stations[i].flowRate_ml_hr, stations[i].totalVolumeMl);
        u8g2.drawStr(x + 11, textY, rBuf);
      }
      u8g2.setDrawColor(1);
    }
  }

  u8g2.drawHLine(0, 53, 128);
  u8g2.setFont(u8g2_font_5x8_tf);
  if (alarmBed > 0) {
    char alertBuf[32];
    snprintf(alertBuf, sizeof(alertBuf), "%sB%d %s", isSnoozed() ? "(ZZ) " : "! ", alarmBed, alertTextEn(alarmCode));
    u8g2.drawBox(0, 54, 128, 10);
    u8g2.setDrawColor(0);
    u8g2.drawStr(2, 62, alertBuf);
    u8g2.setDrawColor(1);
  } else {
    int nearBed = 0;
    for (int i = 0; i < activeStationCount; i++) {
      if (stations[i].alertCode == ALERT_NEAR_END && !stations[i].nearEndAck) { nearBed = i + 1; break; }
    }
    char statBuf[32];
    if (nearBed > 0) {
      const StationData &ns = stations[nearBed - 1];
      int pct = (ns.cfg.planVolumeMl > 0) ? (int)(ns.totalVolumeMl * 100.0f / ns.cfg.planVolumeMl) : 0;
      snprintf(statBuf, sizeof(statBuf), "B%d NEXT BAG %d%% [PWR]", nearBed, pct);
      u8g2.drawFrame(0, 54, 128, 10);
      u8g2.drawStr(2, 62, statBuf);
    } else {
      snprintf(statBuf, sizeof(statBuf), "CH%d WiFi:%d | Bed:%d/%d", currentWifiChannel(),
               (int)WiFi.softAPgetStationNum(), onlineCount, activeStationCount);
      u8g2.drawStr(0, 62, statBuf);
    }
  }
}

void updateHostOLED() {
  if (oledDisplaySleeping || isPowerOffProgressActive) return;
  u8g2.clearBuffer();

  bool nearPending = anyNearEndPending();
  if (!oledScreensaverActive && !globalAlarmTriggered && !nearPending && (millis() - lastUserActivityTime >= 300000)) {
    oledScreensaverActive = true;
  }
  // มีเหตุวิกฤต (ยังไม่พักเสียง) หรือเตือนใกล้หมดที่ยังไม่รับทราบ -> ออกจาก Screensaver เพื่อแสดงเตือน
  if (oledScreensaverActive && ((globalAlarmTriggered && !isSnoozed()) || nearPending)) {
    oledScreensaverActive = false;
    currentOledPage = 0;
  }

  if (oledScreensaverActive) {
    u8g2.setFont(u8g2_font_7x13_tf);
    u8g2.drawStr(20, 10, "SMART IV CLOCK");
    u8g2.drawHLine(10, 13, 108);

    u8g2.setFont(u8g2_font_logisoso32_tf);
    String clockStr = getOledClockStr();
    u8g2.drawStr(4, 56, clockStr.c_str());
  }
  else if (currentOledPage == 0) {
    u8g2.setFont(u8g2_font_5x8_tf);
    u8g2.drawStr(0, 7, "BLOCK MONITOR");
    char hBatBuf[16];
    snprintf(hBatBuf, sizeof(hBatBuf), "Beds:%d", activeStationCount);
    u8g2.drawStr(92, 7, hBatBuf);
    u8g2.drawHLine(0, 9, 128);

    renderBlockStyleGrid();
  }
  else if (currentOledPage >= 1 && currentOledPage <= activeStationCount) {
    int idx = currentOledPage - 1;
    const StationData &s = stations[idx];
    bool isOnline = isStationOnline(idx);
    bool isPaused = isOnline && !s.isRunning;

    u8g2.setFont(u8g2_font_5x8_tf);
    char headBuf[24];
    snprintf(headBuf, sizeof(headBuf), "BED %02d DETAIL  Df:%d", currentOledPage, safeDropFactor(s.cfg.dropFactor));
    u8g2.drawStr(0, 7, headBuf);
    u8g2.drawHLine(0, 9, 128);

    char rateBuf[28];
    if (!isOnline) snprintf(rateBuf, sizeof(rateBuf), "Rate: OFFLINE");
    else if (isPaused) snprintf(rateBuf, sizeof(rateBuf), "Rate: 0.0 (PAUSED)");
    else snprintf(rateBuf, sizeof(rateBuf), "Rate: %3.1f mL/h", s.flowRate_ml_hr);
    u8g2.setFont(u8g2_font_6x10_tf);
    u8g2.drawStr(0, 21, rateBuf);

    u8g2.setFont(u8g2_font_5x8_tf);
    char volBuf[32];
    snprintf(volBuf, sizeof(volBuf), "Vol:%.0f/%.0fmL Set:%.0f", s.totalVolumeMl, s.cfg.planVolumeMl, s.cfg.targetRateHr);
    u8g2.drawStr(0, 32, volBuf);

